import { IFAQ } from "@/types";
import { siteDetails } from "./siteDetails";

export const faqs: IFAQ[] = [
    {
        question: `สินค้าของ ${siteDetails.siteName} มีคุณภาพดีจริงหรือไม่?`,
        answer: 'เราคัดสรรสินค้าจากซัพพลายเออร์ที่มีมาตรฐาน ผ่านการตรวจสอบคุณภาพอย่างเข้มงวด และมีใบรับรองคุณภาพจากสถาบันที่เชื่อถือได้ พร้อมรับประกันคุณภาพทุกชิ้น',
    },
    {
        question: `ใช้เวลานานแค่ไหนในการผลิตและจัดส่ง?`,
        answer: 'ระยะเวลาการผลิตขึ้นอยู่กับประเภทสินค้าและปริมาณ โดยเฉลี่ย 7-14 วันทำการสำหรับสินค้าธรรมดา และ 14-21 วันทำการสำหรับสินค้าคัสตอม รวมการจัดส่ง',
    },
    {
        question: 'มีปริมาณขั้นต่ำในการสั่งผลิตหรือไม่?',
        answer: `ขึ้นอยู่กับประเภทสินค้า โดยทั่วไปเริ่มต้นที่ 50-100 ชิ้น แต่ ${siteDetails.siteName} ยืดหยุ่นและพร้อมปรึกษาเรื่องปริมาณที่เหมาะสมกับงบประมาณของลูกค้า`
    },
    {
        question: 'สามารถขอดูตัวอย่างสินค้าก่อนตัดสินใจได้หรือไม่?',
        answer: 'ได้ครับ เราให้บริการทำตัวอย่าง (Sample) ก่อนการผลิตจริง เพื่อให้ลูกค้าได้เห็นคุณภาพสินค้าและลายพิมพ์โลโก้ อาจมีค่าใช้จ่ายเล็กน้อยสำหรับการทำตัวอย่าง',
    },
    {
        question: 'มีบริการหลังการขายหรือไม่ หากมีปัญหากับสินค้า?',
        answer: 'มีครับ เรามีทีมบริการลูกค้าที่พร้อมช่วยเหลือ 24/7 หากสินค้ามีปัญหาจากการผลิต เรายินดีเปลี่ยนหรือคืนเงินตามเงื่อนไข และมีบริการรับประกันคุณภาพสินค้า'
    }
];